In [1]:
import pandas as pd

In [2]:
names = ["Marge", "Homer", "Bart", "Lisa", "Maggie"]
months = pd.Series( ["March", "May", "February", "May", "January"], index=names)
years = pd.Series([1955, 1956, 1979, 1981, 1988], index=names)

In [3]:
simpsons = pd.DataFrame( 
    {"month": months, 
     "date":  [19, 12, 23, 9, 14], 
     "year": years } 
)

simpsons

           month  date  year
Marge      March    19  1955
Homer        May    12  1956
Bart    February    23  1979
Lisa         May     9  1981
Maggie   January    14  1988

In [4]:
simpsons["year"]

Marge     1955
Homer     1956
Bart      1979
Lisa      1981
Maggie    1988
Name: year, dtype: int64

In [5]:
simpsons[ ["month", "date"] ]

           month  date
Marge      March    19
Homer        May    12
Bart    February    23
Lisa         May     9
Maggie   January    14

In [6]:
simpsons["weekday"] = ["Saturday", "Saturday", "Friday", "Saturday", "Thursday"]

simpsons

           month  date  year   weekday
Marge      March    19  1955  Saturday
Homer        May    12  1956  Saturday
Bart    February    23  1979    Friday
Lisa         May     9  1981  Saturday
Maggie   January    14  1988  Thursday

In [7]:
simpsons.loc["Maggie"]

month       January
date             14
year           1988
weekday    Thursday
Name: Maggie, dtype: object

In [8]:
simpsons.index

Index(['Marge', 'Homer', 'Bart', 'Lisa', 'Maggie'], dtype='object')

In [9]:
simpsons.to_numpy()

array([['March', 19, 1955, 'Saturday'],
       ['May', 12, 1956, 'Saturday'],
       ['February', 23, 1979, 'Friday'],
       ['May', 9, 1981, 'Saturday'],
       ['January', 14, 1988, 'Thursday']], dtype=object)

In [10]:
pd.DataFrame( 
    [ ("white", 5), ("brown", 9), ("pink", 8) ], 
    columns=["Color", "Rating"],
    index=["vanilla", "chocolate", "strawberry"]
    )

            Color  Rating
vanilla     white       5
chocolate   brown       9
strawberry   pink       8